#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
data.aws_caller_identity.current: Reading...
aws_resourcegroups_group.Terraform: Refreshing state... [id=ghablogrggpddemoall]
aws_iam_role.vpclogging: Refreshing state... [id=ghablogiarpdvpclogging]
aws_vpc.vpc_01: Refreshing state... [id=vpc-0d0bfae08f9028557]
aws_iam_role.ecstaskexec: Refreshing state... [id=ghablogiarpdecstaskexec]
aws_s3_bucket.alblogs: Refreshing state... [id=ghablogssspdalblogs20241206233114770300000001]
data.aws_caller_identity.current: Read complete after 0s [id=442426863824]
data.aws_iam_policy_document.mswebappkms: Reading...
data.aws_iam_policy_document.mswebappkms: Read complete after 0s [id=553573790]
aws_kms_key.mswebapp: Refreshing state... [id=e67eebbe-4ab9-4e7c-8b28-12be8993837a]
aws_iam_role_policy.vpclogging: Refreshing state... [id=ghablogiarpdvpclogging:ap-southeast-2irppdvpclogging]
aws_cloudwatch_log_group.mswebapp: Refreshing state... [id=ghablogcwlpdmswebapp]
aws_cloudwatch_log_group.vpc_01: Refreshing state... [id=ghablogcwlpdvpc01flow]
aws_cloudwatch_log_group.ecscluster: Refreshing state... [id=ghablogcwlpdecscluster]
aws_kms_alias.mswebapp: Refreshing state... [id=alias/mswebapp]
aws_ecr_repository.mswebapp: Refreshing state... [id=mswebapp]
aws_ecs_cluster.mswebapp: Refreshing state... [id=arn:aws:ecs:ap-southeast-2:442426863824:cluster/ghablogecspdmswebapp]
aws_ecs_task_definition.mswebapp: Refreshing state... [id=ghablogectpdmswebapp]
aws_ecr_lifecycle_policy.mswebapp: Refreshing state... [id=mswebapp]
aws_iam_role_policy.ecstaskexec: Refreshing state... [id=ghablogiarpdecstaskexec:ap-southeast-2irppdecstaskexec]
aws_subnet.pub_subnet_02: Refreshing state... [id=subnet-0c117ad86e56b8053]
aws_subnet.pub_subnet_01: Refreshing state... [id=subnet-01b27108fbc616fbd]
aws_flow_log.vpc_01: Refreshing state... [id=fl-047667875b684f610]
aws_lb_target_group.mswebapp: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:442426863824:targetgroup/msweb-20241206233118778400000002/c705a1afa2ea2558]
aws_security_group.web01: Refreshing state... [id=sg-0486eeb22e12fefce]
aws_subnet.priv_subnet_02: Refreshing state... [id=subnet-022fdc04037263b31]
aws_internet_gateway.internet_gateway_01: Refreshing state... [id=igw-07f94d0cc722d49f8]
aws_subnet.priv_subnet_01: Refreshing state... [id=subnet-0bdc646104a9a14a9]
aws_security_group.app01: Refreshing state... [id=sg-0a1373b1c473ea2c1]
aws_eip.eip_nat_01: Refreshing state... [id=eipalloc-0e09e9b01a375b1b7]
aws_eip.eip_nat_02: Refreshing state... [id=eipalloc-06b7d3a8f53c50449]
aws_route_table.pub_01: Refreshing state... [id=rtb-018c75a67f504c10c]
aws_s3_bucket_public_access_block.alblogs: Refreshing state... [id=ghablogssspdalblogs20241206233114770300000001]
aws_s3_bucket_versioning.alblogs: Refreshing state... [id=ghablogssspdalblogs20241206233114770300000001]
data.aws_iam_policy_document.S3logsTLS: Reading...
data.aws_iam_policy_document.S3logsTLS: Read complete after 1s [id=3620405340]
aws_s3_bucket_policy.alblogs: Refreshing state... [id=ghablogssspdalblogs20241206233114770300000001]
aws_route_table_association.pub_01: Refreshing state... [id=rtbassoc-082541b4ba1f0ad41]
aws_route_table_association.pub_02: Refreshing state... [id=rtbassoc-02716eab6e8cc12c5]
aws_nat_gateway.nat_gateway_02: Refreshing state... [id=nat-0fd6668ea9052b559]
aws_nat_gateway.nat_gateway_01: Refreshing state... [id=nat-089173e9490b2dc8b]
aws_route_table.priv_02: Refreshing state... [id=rtb-0e80b3a911b0b5a72]
aws_route_table.priv_01: Refreshing state... [id=rtb-073a164a19b5a312c]
aws_route_table_association.pv_01: Refreshing state... [id=rtbassoc-00b3b81679f34708b]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecs_service.mswebapp will be created
  + resource "aws_ecs_service" "mswebapp" {
      + cluster                            = "arn:aws:ecs:ap-southeast-2:442426863824:cluster/ghablogecspdmswebapp"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 2
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "ap-southeast-2iarpdsvcmswebapp"
      + platform_version                   = (known after apply)
      + propagate_tags                     = "TASK_DEFINITION"
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "Name"  = "ap-southeast-2iarpdsvcmswebapp"
          + "rtype" = "ecsservice"
        }
      + tags_all                           = {
          + "Environment" = "Production"
          + "Name"        = "ap-southeast-2iarpdsvcmswebapp"
          + "Provisioner" = "Terraform"
          + "Solution"    = "AWS-GHA-TF-MSFT"
          + "rtype"       = "ecsservice"
        }
      + task_definition                    = "arn:aws:ecs:ap-southeast-2:442426863824:task-definition/ghablogectpdmswebapp:1"
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "mswebapp"
          + container_port   = 8080
          + target_group_arn = "arn:aws:elasticloadbalancing:ap-southeast-2:442426863824:targetgroup/msweb-20241206233118778400000002/c705a1afa2ea2558"
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-0a1373b1c473ea2c1",
            ]
          + subnets          = [
              + "subnet-022fdc04037263b31",
              + "subnet-0bdc646104a9a14a9",
            ]
        }
    }

  # aws_lb.mswebapp will be created
  + resource "aws_lb" "mswebapp" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = true
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = false
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "ghablogalbpdmswebapp"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = [
          + "sg-0486eeb22e12fefce",
        ]
      + subnets                                                      = [
          + "subnet-01b27108fbc616fbd",
          + "subnet-0c117ad86e56b8053",
        ]
      + tags                                                         = {
          + "Name"  = "ap-southeast-2albpdmswebapp"
          + "rtype" = "network"
        }
      + tags_all                                                     = {
          + "Environment" = "Production"
          + "Name"        = "ap-southeast-2albpdmswebapp"
          + "Provisioner" = "Terraform"
          + "Solution"    = "AWS-GHA-TF-MSFT"
          + "rtype"       = "network"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)

      + access_logs {
          + bucket  = "ghablogssspdalblogs20241206233114770300000001"
          + enabled = true
          + prefix  = "albaccesslogs"
        }
    }

  # aws_lb_listener.mswebapp will be created
  + resource "aws_lb_listener" "mswebapp" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags              = {
          + "Name"  = "ap-southeast-2lblpdmswebapp"
          + "rtype" = "network"
        }
      + tags_all          = {
          + "Environment" = "Production"
          + "Name"        = "ap-southeast-2lblpdmswebapp"
          + "Provisioner" = "Terraform"
          + "Solution"    = "AWS-GHA-TF-MSFT"
          + "rtype"       = "network"
        }

      + default_action {
          + order            = (known after apply)
          + target_group_arn = "arn:aws:elasticloadbalancing:ap-southeast-2:442426863824:targetgroup/msweb-20241206233118778400000002/c705a1afa2ea2558"
          + type             = "forward"
        }
    }

  # aws_route_table_association.pv_02 will be created
  + resource "aws_route_table_association" "pv_02" {
      + id             = (known after apply)
      + route_table_id = "rtb-0e80b3a911b0b5a72"
      + subnet_id      = "subnet-022fdc04037263b31"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + mswebapp_alb_dns_name = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @ndpalmer, Action: `pull_request`, Working Directory: ``, Workflow: `Review and deploy Production environment`*